tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "docker"
cask "docker"

brew "git"

# Official Amazon AWS command-line interface
brew "awscli"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"

# cli等でjsonを簡単に扱う
brew "jq"

# Mac App Store command-line interface
brew "mas"

# Additional completion definitions for zsh
brew "zsh-completions"

# アプリのクリーンインストールに
cask "appcleaner"

# password manager
cask "1password"

# Clipboard extension app
cask "clipy"

# Free and open-source image editor
cask "gimp"

# Web browser
cask "google-chrome"

# App to write, plan, collaborate, and get organized
cask "notion"

# quicklookでjsonをpreviewできる
cask "quicklook-json"

# Digital design and prototyping platform
cask "sketch"
cask "figma"

# コミュニケーションツール
cask "slack"
cask "discord"

# Open-source code editor
cask "visual-studio-code"

mas 'Twitter', id: 1482454543
mas 'Xcode', id: 497799835